Revit 2027 API
SizingOptions.SetNextAvailableSize(ConnectorProfileType, Double, Double, ISet<MEPSize>) Method
 Sets the next available size based on the specified inner diameter.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetNextAvailableSize(
	ConnectorProfileType profileType,
	double width,
	double height,
	ISet<MEPSize> availableSizes
)
Public Sub SetNextAvailableSize (
	profileType As ConnectorProfileType,
	width As Double,
	height As Double,
	availableSizes As ISet(Of MEPSize)
)
public:
void SetNextAvailableSize(
	ConnectorProfileType profileType,
	double width,
	double height,
	ISet<MEPSize^>^ availableSizes
)
member SetNextAvailableSize :
        profileType : ConnectorProfileType *
        width : float *
        height : float *
        availableSizes : ISet<MEPSize> -> unit
Parameters
profileType ConnectorProfileType
 The profile type of the duct or pipe, such as round, rectangular or oval.
width Double
 The width value that the next available size must exceed.
height Double
 The height value that the next available size must exceed.
availableSizes ISet<MEPSize>
 The sorted list of available sizes for both width and height, where the smallest possible size yet larger than the specified value will be selected.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for width must be positive. -or- The given value for height must be positive. -or- The width must be within the range of availableSizes. -or- The height must be within the range of availableSizes. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
SizingOptions Class
SetNextAvailableSize Overload
Autodesk.Revit.DB.Analysis Namespace